---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.FileExportingEventArgs
source: html/9b8b032e-035b-ece7-0274-8186579e08ef.htm
---
# FileExportingEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.